Repository: turris-cz/diagnostics
Catalog: locale/*/LC_MESSAGES/turris-diagnostics.po
Languages: de, nb_no, sk

source: print this help text
nb_no: skriv ut denne hjelpeteksten
sk: vypísať tento pomocný text

source: list all available modules in machine readable format
nb_no: list opp alle tilgjengelige moduler i maskinlesbart format
sk: zoznam všetkých dostupných modulov v strojovo čitateľnom formáte

source: run in background
de: im Hintergrund ausführen
nb_no: kjør i bakgrunnen
sk: spustiť na pozadí

source: print output to a file
de: Schreibe das Ergebnis in eine Datei
nb_no: skriv utdata til en fil
sk: vypísať výstup do súboru

source: print output to a directory module per file
de: Schreibe die Ausgabe in einen Ordner in separate Dateien für einzelne Module
nb_no: skriv utdata til en katalogmodul per fil
sk: vypísať výstup do priečinku, osobitný súbor pre každý modul

source: modules:
de: Module:
sk: moduly:

source: Basic info identifying router and system it is running.
sk: Základné informácie o routeri a jeho systéme.

source: Verify that NTP can synchronize time.
sk: Overiť, či NTP môže synchronizovať čas.

source: Gets versions of firmwares including the U-Boot environment configuration.
sk: Získanie verzie firmwaru vrátane konfigurácie prostredia U-Boot.

source: List detected hardware on USB and PCI.
nb_no: List opp oppdaget maskinvare på USB og PCI.
sk: Zoznam zisteného hardware na USB a PCI.

source: List all mount points and mount options and all block devices including amount of free space.
sk: Zoznam všetkých bodov pripojenia a možností pripojenia a všetkých blokových zariadení vrátane voľného miesta.

source: Examine running services and show whether the services are started after boot.
nb_no: Undersøker kjørende tjenester, og viser hvorvidt tjenestene er startet etter oppstart
sk: Preskúmať spustené služby a zobraziť, či sa služby spúšťajú pri štarte systému.

source: List running processes.
nb_no: List opp kjørende prosesser.
sk: Zobraziť spustené procesy.

source: Prints UCI network and wireless settings, current IP addresses, and routes.
sk: Vypísať sieť UCI a nastavenia Wi-Fi, aktuálne IP adresy a smerovania.

source: Gather DNS related information.
sk: Zhromaždiť informácie súvisiace s DNS.

source: Prints sockets info about all sockets.
sk: Vypísať informácie o všetkých socketoch.

source: Print UCI firewall settings and the current content of iptables.
sk: Vypísať nastavenia UCI firewallu a aktuálny obsah iptables.

source: Info about the cron.
sk: Informácie o cron.

source: List installed packages and OPKG configuration.
sk: Vypísať nainštalované balíčky a konfiguráciu OPKG.

source: Test whether the Turris webs are available.
nb_no: Test hvorvidt Turris-nettsiden er tilgjengelig.
sk: Otestovať dostupnosť webstránok Turris.

source: Prints configuration and state of Foris web interface.
sk: Vypísať konfiguráciu a stav webového rozhrania Foris.

source: Generate and send Turris notification.
nb_no: Generer og sendt Turris-merknad.
sk: Vygenerovať a odoslať Turris notifikáciu.

source: Run Sentinel Certgen.
nb_no: Kjør Sentinel sertifikatsgenerering.
sk: Spustiť Sentinel Certgen.

source: State of Sentinel probes
sk: Stav Sentinel Probes

source: Honeypot as a Service configuration dump
sk: Dump konfigurácie Honeypot as a Service

source: Read system logs.
nb_no: Les systemlogger.
sk: Načítať systémové záznamy (logy).

source: Display output of dmesg.
nb_no: Vis utdata fra dmesg.
sk: Zobraziť výstup z dmesg.

source: list installed packages
de: installierte Pakete auflisten

source: how long is the router running
de: Wie lange ist der Router eingeschaltet

source: get serial number from mox-otp or atsha204
de: Hole die Seriennummer von mox-otp oder atsha204

source: info about about the cron
de: Informationen über Cron

source: list all mount points and mount options and all block devices
de: Liste alle Einhängepunkte und Einhängeoptionen und alle Blockgeräte

source: show info about linux kernel
de: Zeige Informationen über den Linux Kernel

source: gather dns related informations
de: Sammle zu DNS gehörende Informationen

source: lists u-boot environment
de: Listet die U-Boot Umgebung auf

source: test whether the turris webs are available
de: Prüfe ob die Turris Webseite verfügbar ist

source: list running processes
de: Liste laufende Prozesse auf

source: dump configuration and try to run updater
de: Liste die Einstellungen auf und versuche das Update auszuführen

source: list detected hardware on usb and pci
de: Liste erkannte Geräte an USB und PCI auf

source: try to send firewall logs to the server
de: Versuche Firewall Protokolldaten an den Server zu senden

source: Print current date and verify that NTP can synchronize time.
de: Zeige das jetzige Datum und überprüfe ob NTP die Zeit synchronisieren kann.

source: print uci firewall settings and the currnet content of iptables
de: Liste die UCI Firewall Einstellungen und den momentanen Inhalt der IP-Tabellen

source: read /var/log/messages
de: Lese /var/log/messages

source: prints uci network and wireless settings, current ip addresses and routes
de: Liste die UCI Netzwerk- und Drahtlos- Einstellungen, die momentanen IP Adressen und Routen

source: shows mounted devices and examines files in /tmp/
de: Zeige eingehängte Geräte und untersuche Dateien /tmp/

source: examines running services and shows whether the services are started after boot
de: Untersuche laufende Dienste und zeige ob die Dienste nach dem Hochfahren gestartet wurden

source: display output of dmesg
de: Zeige die Ausgabe von dmesg

source: Show info about Linux kernel.
nb_no: Vis info om Linux-kjerne.

source: List all mount points and mount options and all block devices.
nb_no: List opp alle monteringspunkter og monteringsvalg, samt alle blokkenheter.

source: Prints all listening sockets.
nb_no: Skriver ut alle lytte-sockets.

source: List installed packages.
nb_no: List opp installerte pakker.

source: Dump configuration and try to run the updater.
nb_no: Dump oppsett og prøv å kjøre oppdatereren.

source: Try to send firewall logs to the server.
nb_no: Forsøk forsendelse av brannmurslogger til tjeneren.
