Repository: turris-cz/diagnostics
Catalog: locale/*/turris-snapshots-web.po
Languages: cs, de, es, it, nb_no, pl, ru, sk, sv

source: Minimal Snapshot Manager | Turris
cs: Minimální správce snímků | Turris
de: Minimal-Schnappschuss-Manager | Turris
es: Administrador de instantáneas minimalista | Turris
sk: Minimálny správca bodov obnovenia | Turris

source: Toggle theme (auto)
cs: Přepnout téma (auto)
de: Thema umschalten (automatisch)
es: Cambiar tema (automático)
sk: Prepnúť tému (automaticky)

source: Toggle theme
cs: Přepnout téma
de: Thema umschalten
es: Cambiar tema
sk: Prepnúť tému

source: Light
cs: Světlé
de: Hell
es: Claro
sk: Svetlá

source: Dark
cs: Tmavé
de: Dunkel
es: Oscuro
sk: Tmavá

source: Auto
cs: Automaticky
de: Automatisch
es: Automático
sk: Automatická

source: Turris Logo
cs: Logo Turris
es: Logotipo de Turris

source: Minimal Snapshot Manager
cs: Minimální správce snímků
es: Administrador de instantáneas minimalista
sk: Minimálny správca bodov obnovenia

source: This page allows minimal management of system snapshots.
cs: Tato stránka umožňuje minimální správu systémových snímků.
de: Diese Seite ermöglicht eine minimale Verwaltung von System-Schnappschüssen.
es: Esta página proporciona administración básica de instantáneas del sistema.
sk: Táto stránka umožňuje minimálne spravovanie systémových bodov obnovenia.

source: Select snapshot
cs: Zvolit snímek
de: Schnappschuss auswählen
es: Seleccionar instantánea
it: Seleziona snapshot
nb_no: Velg avtrykk
pl: Wybierz migawkę
ru: Выберите образ
sk: Vyberte bod obnovenia
sv: Välj ögonblicksbild

source: Select an existing snapshot to perform the action on.
cs: Zvolte existující snímek, na kterém chcete provést akci.
de: Wählen Sie einen vorhandenen Schnappschuss aus, für den Sie die Aktion durchführen möchten.
es: Seleccione una instantánea para realizar la acción.
sk: Vyberte existujúci bod obnovenia, s ktorým sa má vykonať akcia.

source: Export
de: Exportieren
es: Exportar
it: Esporta
nb_no: Eksporter
pl: Wyeksportuj
ru: Экспорт
sv: Exportera

source: Rollback
cs: Vrátit zpět
de: Zurückrollen
es: Revertir
it: Ripristina
nb_no: Rull tilbake
pl: Przywróć
ru: Откат
sk: Vrátiť späť
sv: Tillbakarullning

source: Remove
cs: Odstranit
de: Entfernen
es: Eliminar
it: Rimuovi
nb_no: Fjern
pl: Usuń
ru: Удаления
sk: Odstrániť
sv: Ta bort

source: Password to encrypt the snapshot with
cs: Heslo pro zašifrování snímku
de: Passwort zum Verschlüsseln des Schnappschusses
es: Contraseña para cifrar la instantánea
sk: Heslo na zašifrovanie bodu obnovenia

source: Password used to encrypt the exported snapshot. It is prefilled with a randomly generated one.
cs: Heslo, které se použije pro zašifrování exportovaného snímku. Předvyplněná hodnota je náhodně generované heslo.
de: Passwort, das zur Verschlüsselung des exportierten Schnappschusses verwendet wird. Es ist mit einem zufällig generierten Passwort vorausgefüllt.
es: Contraseña utilizada para cifrar la instantánea exportada. Se completa previamente con una contraseña generada aleatoriamente.
sk: Heslo na zašifrovanie exportovaného bodu obnovenia. Vyplnená hodnota je náhodne generované heslo.

source: Export selected snapshot
cs: Exportovat zvolený snímek
de: Ausgewählten Schnappschuss exportieren
es: Exportar la instantánea seleccionada
it: Esporta lo snapshot selezionato
nb_no: Eksporter valgt avtrykk
pl: Wyeksportuj wybraną migawkę
ru: Экспортировать выбранный образ
sk: Exportovať vybraný bod obnovenia
sv: Exportera den valda ögonblicksbilden

source: The following snippet shows how to decrypt an exported snapshot:
cs: Následující úryvek ukazuje, jak dešifrovat exportovaný snímek:
de: Der folgende Ausschnitt zeigt, wie ein exportierter Schnappschuss entschlüsselt wird:
es: El siguiente fragmento muestra cómo descifrar la instantánea exportada:
sk: Nasledujúca ukážka ilustruje, ako dešifrovať exportovaný bod obnovenia:

source: Export selected snapshot for use as Medkit
cs: Exportovat zvolený snímek, aby byl použitelný jako Medkit
de: Ausgewählten Schnappschuss zur Verwendung als Medkit exportieren
es: Exportar la instantánea seleccionada para usarla como Medkit
sk: Exportovať vybraný bod obnovenia na použitie ako Medkit

source: Roll back to the selected snapshot and reboot the router
cs: Vrátit se na zvolený snímek a restartovat router
de: Auf den ausgewählten Schnappschuss zurückrollen und Router neu starten
es: Regresar a la instantánea seleccionada y reiniciar el enrutador
sk: Vrátiť sa na vybraný bod obnovenia a reštartovať router

source: Remove the selected snapshot
cs: Odstranit zvolený snímek
de: Augewählten Schnappschuss entfernen
es: Eliminar la instantánea seleccionada
it: Rimuovi lo snapshot selezionato
nb_no: Fjern valgt avtrykk
pl: Usuń wybraną migawkę
ru: Удалить выбранный образ
sk: Odstrániť vybraný bod obnovenia
sv: Ta bort den valda ögonblicksbilden

source: Medkit
de: Medkit (Verbandskasten)
pl: Apteczka
ru: Аптечка
sv: Första hjälpen-kit

source: Turris Minimal Snapshots Manager
it: Semplice gestore degli snapshot di Turris
nb_no: Turris minimal øyeblikkavtrykkshåndterer
pl: Minimalny menedżer migawek Turris
ru: Менеджер минимальных образов Turris

source: Minimal Snapshots Manager
it: Semplice gestore degli snapshot
nb_no: Minimal øyeblikkavtrykkshåndterer
pl: Minimalny menedżer migawek
ru: Менеджер минимальных образов

source: This page allows the minimal management of system snapshots.
it: Questa pagina consente una semplice gestione degli snapshot di sistema.
nb_no: Denne siden tillater minimal håndtering av systemavtrykk.
pl: Ta strona pozwala na uproszczone zarządzanie migawkami systemu.
ru: Эта страница обеспечивает управление образами системы.

source: Select the existing snapshot to perform action on.
it: Seleziona uno snapshot esistente su cui eseguire l'azione.
nb_no: Velg eksisterende avtrykk å utføre handlingen for.
pl: Wybierz istniejącą migawkę, aby wykonać na niej akcję.
ru: Выберите существующий образ для действия.
sv: Välj den befintliga ögonblicksbilden att utföra åtgärden på.

source: Password to encrypt snapshot with
it: Password per la cifratura dello snapshot
nb_no: Passord å kryptere avtrykket med
pl: Hasło do zaszyfrowania migawki
ru: Пароль для шифрования образа с помощью
sv: Lösenord att kryptera ögonblicksbilden med

source: The password used to encrypt exported snapshot. It is prefilled with randomly generated password.
it: La password utilizzata per cifrare lo snapshot esportato. Precompilata con una password casuale.
pl: Hasło używane do szyfrowania wyeksportowanej migawki. Wstępnie wypełnione losowo wygenerowanymi znakami.
ru: Пароль, используемый для шифрования экспортированного образа. Он предварительно случайно сгенерирован.
sv: Lösenordet som används för att kryptera den exporterade ögonblicksbilden. Den är ifylld på förhand med ett slumpmässigt utvalt lösenord.

source: The following snipet shows how to decrypt exported snapshot:
it: L'esempio seguente mostra come decifrare lo snapshot esportato:
pl: Następujący fragment pokazuje jak odszyfrować wyeksportowaną migawkę:
ru: В следующем фрагменте показано, как расшифровать экспортированный образ:
sv: Följande utdrag visar hur man avkrypterar en exporterad ögonblicksbild:

source: Export selected snapshot to be used as Medkit
it: Esporta lo snapshot selezionato per utilizzarlo come Medkit
pl: Wyeksportuj wybraną migawkę do użycia jako Apteczka
ru: Экспортировать выбранный образ для использования в качестве аптечки
sv: Exportera den valda ögonblicksbilden som ska användas som Medkit

source: Rollback to the selected snapshot and reboot the router
it: Ripristina lo snapshot selezionato e riavvia il router
nb_no: Rull tilbake til valgt avtrykk og start ruteren på ny
pl: Przywróć stan do wybranej migawki uruchom ponownie router
ru: Откат к выбранному образу и перезагрузка роутера
sv: Rulla tillbaka till den valda ögonblicksbilden och starta om routern
