Repository: turris-cz/diagnostics
Catalog: locale/*/turris-diagnostics.po
Languages: cs, de, es, fr, hu, it, pl, ru, sk

source: print this help text
cs: vypsat tuto nápovědu
de: diesen Hilfetext ausgeben
es: imprimir este texto de ayuda
fr: imprimer ce texte d’aide
hu: a súgószöveg nyomtatása
it: stampa questo testo di aiuto
pl: wydrukuj ten tekst pomocy
ru: распечатать этот текст справки
sk: vytlačiť tento pomocný text

source: list all available modules in machine readable format
cs: seznam všech dostupných modulů ve strojově čitelném formátu
de: alle verfügbaren Module in maschinenlesbarem Format auflisten
es: listar todos los módulos disponibles en un formato legible para las máquinas
fr: lister tous les modules disponibles dans un format lisible par les machines
hu: az összes rendelkezésre álló modul felsorolása géppel olvasható formátumban
it: elenca tutti i moduli disponibili in un formato leggibile a macchina
pl: lista wszystkich dostępnych modułów w formacie do odczytu maszynowego
ru: перечислить все доступные модули в машиночитаемом формате
sk: zoznam všetkých dostupných modulov v strojovo čitateľnom formáte

source: run in background
cs: spustit na pozadí
de: im Hintergrund ausführen
es: ejecutar en segundo plano
fr: Exécuter en arrière-plan
hu: futtatás a háttérben
it: esegui in background
pl: uruchom w tle
ru: запустить в фоновом режиме
sk: spustiť na pozadí

source: print output to a file
cs: vypsat výstup do souboru
de: In eine Datei schreiben
es: guardar salida en un archivo
fr: imprimer la sortie dans un fichier
hu: kimenet nyomtatása fájlba
it: salva la diagnostica in un file
pl: wypisuje dane wyjściowe do pliku
ru: распечатать в файл
sk: zapísať výstup do súboru

source: print output to a directory module per file
cs: vypsat výstup do složky do zvlášť souborů pro jednotlivé moduly
de: Ausgabe in einem Ordner in separate Dateien für einzelne Module speichern
es: guardar salida en un módulo de directorio por archivo
fr: afficher la sortie vers un module de répertoire par fichier
hu: kimenet nyomtatása mappába, modulonként külön fájlba
it: salva i file diagnostici nella cartella specificata
pl: wypisuje dane wyjściowe do modułu katalogu na plik
ru: вывод на печать в каталог с файлом для каждого модуля
sk: zapísať výstup do priečinku, pre každý modul samostatný súbor

source: modules:
cs: moduly:
de: Module:
es: módulos:
hu: modulok:
it: moduli:
pl: moduły:
ru: модули:
sk: moduly:

source: Basic info identifying router and system it is running.
cs: Základní informace identifikující směrovač a systém, který na něm běží.
de: Grundlegende Informationen über den Router und das System, das darauf läuft.
es: Información básica que identifica el router y el sistema que utiliza.
fr: Informations de base identifiant le routeur et le système qu'il utilise.
it: Informazioni di base identificanti il router e il sistema in esecuzione.
ru: Основная информация о маршрутизаторе и его системе.
sk: Základné informácie identifikujúce router a jeho systém.

source: Verify that NTP can synchronize time.
cs: Ověřit, že NTP může synchronizovat čas.
de: Sicherstellen, dass NTP die Zeit synchronisieren kann.
es: Verificar que NTP puede sincronizar la hora.
fr: Vérifiez que NTP peut synchroniser l'heure.
it: Verifica la capacità di NTP di sincronizzare l'ora.
ru: Проверить, что NTP может синхронизировать время.
sk: Overiť, či je NTP schopný synchronizovať čas.

source: Gets versions of firmwares including the U-Boot environment configuration.
cs: Získává verze firmwaru včetně nastavení prostředí U-Boot.
de: Ruft die Versionen der Firmwares ab, einschließlich der Umgebungskonfiguration von U-Boot.
es: Obtiene las versiones de los firmware incluyendo la configuración de U-Boot.
fr: Obtient les versions des micrologiciels, y compris la configuration U-Boot.
it: Ottieni le versioni dei firmware, inclusa la configurazione di U-Boot.
ru: Получить версии прошивок, включая конфигурацию среды U-Boot.
sk: Získanie verzie firmwaru vrátane konfigurácie prostredia U-Boot.

source: List detected hardware.
cs: Vypsat zjištěný hardware.
de: Erkannte Hardware auflisten.
es: Lista de hardware detectada.
fr: Liste du matériel détecté.
it: Elenco dell'hardware riconosciuto.
ru: Список обнаруженного оборудования.
sk: Zobraziť zoznam zisteného hardware.

source: List all mount points and mount options and all block devices including amount of free space.
cs: Vypsat veškeré přípojné body, předvolby připojení a všechna bloková zařízení včetně volného prostoru.
de: Alle Einhängepunkte und Einhängeoptionen sowie alle Blockgeräte einschließlich des freien Speicherplatzes auflisten.
es: Listar todos los puntos y opciones de montaje, y todos los dispositivos de bloque incluyendo la cantidad de espacio disponible.
fr: Lister tous les points et options de montage ainsi que tous les périphériques de bloc avec l'espace libre.
it: Elenca tutti i punti di mount e le relative opzioni e tutti i dispositivi a blocchi inclusa la quantità di spazio disponibile.
ru: Список всех точек монтирования и параметров монтирования, а также все блочные устройства, включая количество свободного места.
sk: Zobraziť zoznam všetkých bodov pripojenia, predvolieb pripojenia a všetkých blokových zariadení vrátane voľného miesta.

source: Examine running services and show whether the services are started after boot.
cs: Prozkoumá spuštěné služby a zobrazí, zda jsou služby spouštěné po zavedení systému.
de: Untersuche laufende Dienste und zeige, ob die Dienste nach dem Hochfahren gestartet wurden.
es: Examinar los servicios en funcionamiento y mostrar si los servicios son lanzados después del inicio.
fr: Examinez les services en cours de fonctionnement et montrez les services lancés après le démarrage.
hu: Vizsgálja meg a futó szolgáltatásokat, és mutassa meg, hogy a szolgáltatások indítás után elindultak-e.
it: Esamina i servizi avviati e mostra se vengono avviati dopo il boot.
pl: Sprawdź działające usługi i pokaż, czy są one uruchamiane po uruchomieniu.
ru: Проверить запущенные службы и показать запущенные службы после загрузки.
sk: Preskúmať spustené služby a zobraziť, či sa spúšťajú pri štarte systému.

source: List running processes.
cs: Vypsat spuštěné procesy.
de: Laufende Prozesse auflisten.
es: Listar los procesos en ejecución.
fr: lister les processus en cours.
hu: Futó folyamatok listája.
it: Elenca i processi in esecuzione.
pl: Lista uruchomionych procesów.
ru: Список запущенных процессов.
sk: Zobraziť spustené procesy.

source: Prints UCI network and wireless settings, current IP addresses, and routes.
cs: Vypíše nastavení sítě a Wi-Fi, stávající IP adresy a trasy.
de: Druckt UCI-Netzwerk- und WLAN-Einstellungen, aktuelle IP-Adressen und Routen.
es: Imprimir los ajustes de red UCI e inalámbrica, las direcciones IP actuales y las rutas.
fr: Imprime les paramètres réseau UCI et sans fil, les adresses IP actuelles et les routes.
hu: Kinyomtatja az UCI hálózati és vezeték nélküli beállításait, az aktuális IP-címeket és útvonalakat.
it: Stampa i parametri di rete UCI e wireless, gli indirizzi attuali e le regole di instradamento.
pl: Drukuje ustawienia sieci i sieci bezprzewodowej UCI, aktualne adresy IP i trasy.
ru: Вывести сетевые и беспроводные настройки, текущие IP-адреса и маршруты.
sk: Zobraziť nastavenie siete UCI a Wi-Fi, aktuálne IP adresy a smerovania.

source: Gather DNS related information.
cs: Shromáždit informace související s DNS.
de: Sammelt Informationen bezüglich DNS.
es: Recopilar información relativa al DNS.
fr: Rassembler les informations relatives au DNS.
hu: DNS-sel kapcsolatos információk gyűjtése.
it: Raccogli le informazioni relative ai DNS.
pl: Zbierz informacje związane z DNS.
ru: Собрать информацию, связанную с DNS.
sk: Zhromaždiť informácie o DNS.

source: Prints sockets info about all sockets.
cs: Vypisuje informace o všech socketech.
de: Gibt Socket-Informationen zu allen Sockets aus.
es: Imprime información acerca de los sockets.
fr: Affiche les informations sur les sockets.
it: Stampa le informazioni sui sockets.
ru: Вывести информацию обо всех сокетах.
sk: Zobraziť informácie o všetkých socketoch.

source: Print UCI firewall settings and the current content of iptables.
cs: Vypsat nastavení brány firewall v rozhraní uci a stávající obsah iptables.
de: Gibt die UCI-Firewall-Einstellungen und den derzeitigen Inhalt der iptables aus.
es: Imprimir los ajusted UCI de cortafuegos y el contenido actual de iptables.
fr: Imprimez les paramètres du pare-feu UCI et le contenu actuel d'iptables.
hu: Nyomtassa ki az UCI tűzfal beállításait és az iptables aktuális tartalmát.
it: Stampa i parametri del firewall UCI e il contenuto attuale di iptables.
pl: Wyświetl ustawienia zapory UCI i aktualną zawartość iptables.
ru: Вывести настройки брандмауэра uci и текущее содержимое iptables.
sk: Zobraziť nastavenia brány firewall v rozhraní UCI a aktuálny obsah iptables.

source: Info about the cron.
cs: Informace o naplánovaných úlohách.
de: Informationen über Cron.
es: Información acerca de cron.
fr: Informations sur le cron.
hu: Információ a cronról.
it: Informazioni sul cron.
pl: Informacje o pliku cron.
ru: Информация о cron.
sk: Informácie o cron.

source: List installed packages and OPKG configuration.
cs: Vypsat nainstalované balíčky a konfiguraci OPKG.
de: Installierte Pakete und OPKG-Konfiguration auflisten.
es: Listar los paquetes instalados y la configuración OPKG.
fr: Liste les paquets installés et la configuration du gestionnaire OPKG.
it: Elenca i pacchetti installati e la configurazione di OPKG.
ru: Список установленных пакетов и конфигурации OPKG.
sk: Zobraziť nainštalované balíčky a konfiguráciu OPKG.

source: Test whether the Turris webs are available.
cs: Vyzkoušet, zda jsou dostupné weby Turris.
de: Prüft, ob die Turris-Webseite verfügbar ist.
es: Verificar si los sitios web de Turris están disponibles.
fr: Vérifiez si les sites web Turris sont disponibles.
hu: Ellenőrizze, hogy a Turris hálózatai rendelkezésre állnak-e.
it: Verifica la disponibilità dei siti web Turris.
pl: Sprawdź, czy sieci Turris są dostępne.
ru: Проверьте, доступны ли сети Turris.
sk: Vyskúšať dostupnosť webstránok Turris.

source: Prints configuration and state of Foris web interface.
cs: Vypisuje nastavení a stav webového rozhraní Foris.
de: Gibt die Konfiguration und den Zustand der Foris-Webschnittstelle aus.
es: Imprime el estado y la configuración de la interfaz web de Foris.
fr: Affiche l'état et la configuration de l'interface web Foris.
it: Stampa configurazione e stato dell'interfaccia web Foris.
ru: Вывести конфигурацию и состояние веб-интерфейса Foris.
sk: Zobraziť konfiguráciu a stav webového rozhrania Foris.

source: Generate and send Turris notification.
cs: Vytvořit a poslat Turris upozornění.
de: Erzeugt und sendet eine Turris-Benachrichtigung.
es: Generar y enviar el informe a Turris.
fr: Générer et envoyer le rapport à Turris.
hu: Turris-értesítés létrehozása és küldése.
it: Genera e spedisci la notifica a Turris.
pl: Wygeneruj i wyślij powiadomienie Turris.
ru: Создать и отправить уведомление Turris.
sk: Vytvoriť a odoslať Turris notifikáciu.

source: Run Sentinel Certgen.
cs: Spustit Sentinel Certgen.
de: Führt Sentinel Certgen aus.
es: Ejecutar Sentinel Certgen.
fr: Exécuter la Sentinel Certgen.
hu: A Sentinel Certgen futtatása.
it: Esegui Sentinel Certgen.
pl: Uruchom Sentinel Certgen.
ru: Запустить генератор сертификатов Sentinel.
sk: Spustiť Sentinel Certgen.

source: State of Sentinel probes
cs: Stav sond systému Sentinel
de: Zustand der Sentinel-Sonden
es: Estado de las sondas Sentinel
fr: Etat des sondes Sentinel
it: Stato delle sonde Sentinel
ru: Состояние зондов Sentinel
sk: Stav sond systému Sentinel

source: Honeypot as a Service configuration dump
cs: Výpis nastavení systému HaaS (Honeypot as a Service)
de: Honeypot-as-a-Service-Konfiguration ausgeben
es: Volcado de la configuración del servicio de honeypot (HaaS)
fr: Image de la configuration du service pot de miel (HaaS)
it: Scarica la configurazione del servizio Honeypot (Haas)
ru: Конфигурация Honeypot как службы
sk: Výpis konfigurácie systému HaaS (Honeypot as a Service)

source: Read system logs.
cs: Číst záznamy událostí v systému.
de: Liest System-Logs aus.
es: Leer los registros del sistema.
fr: Lit les journaux systèmes.
hu: Rendszernaplók elolvasása.
it: Leggi i log di sistema.
pl: Przeczytaj dzienniki systemowe.
ru: Прочтать системные журналы.
sk: Načítať systémové záznamy (logy).

source: Display output of dmesg.
cs: Zobrazí výstup z dmesg.
de: Zeigt die Ausgabe von dmesg.
es: Mostrar la salida de dmesg.
fr: Affiche la sortie de dmesg.
hu: A dmesg kimenetének megjelenítése.
it: Visualizza l'output di dmesg.
pl: Wyświetl wyjście dmesg.
ru: Показать вывод dmesg.
sk: Zobraziť výstup z dmesg.
