Repository: turris-cz/diagnostics
Catalog: locale/*/turris-diagnostics-web.po
Languages: cs

source: Diagnostics | Turris
cs: Diagnostiky | Turris

source: Toggle theme (auto)
cs: Přepnout motiv vzhledu (auto)

source: Toggle theme
cs: Přepnout motiv vzhledu

source: Light
cs: Světlý

source: Dark
cs: Tmavý

source: Auto
cs: Automaticky

source: Turris Logo
cs: Logo Turris

source: Diagnostics
cs: Diagnostiky

source: This page allows you to generate diagnostics report for your Turris router.
cs: Tato stránka vám umožňuje vytvořit diagnostické hlášení pro váš směrovač Turris.

source: Generate and download diagnostics
cs: Vytvořit a stáhnout si diagnostiky

source: Make sure that download is finished before sending it to support or disconnecting from the router's network. The report is being generated during download, so it takes a considerable amount of time.
cs: Předtím, než ho odešlete podpoře, nebo se odpojíte od sítě směrovače ověřte, zda bylo stahování dokončeno. Stažení hlášení zabere delší dobu, protože je v průběhu stahování teprve vytvářeno.
